_global.translation['ja'] = {

  //HTMLCSAuditor.js
  "auditor_name" : 'HTML_CodeSniffer by Squiz'
  ,"auditor_using_standard" : 'Web標準の使用'
  ,"auditor_standards" : '達成等級'
  ,"auditor_code_snippet" : 'コードスニペット'
  ,"auditor_close" : '閉じる'
  ,"auditor_select_types" : 'レポートに含める課題の種類を選択します。'
  ,"auditor_home" : 'ホーム'
  ,"auditor_view_report" : 'レポートを見る'
  ,"auditor_report" : 'レポート'
  ,"auditor_back_to_report" : 'レポートへ戻る'
  ,"auditor_previous_issue" : '前の課題'
  ,"auditor_next_issue" : '次の課題'
  ,"auditor_issue" : '課題'
  ,"auditor_of" : '/'
  ,"auditor_errors" : 'エラー'
  ,"auditor_error" : 'エラー'
  ,"auditor_warnings" : '警告'
  ,"auditor_warning" : '警告'
  ,"auditor_notices" : '要確認'
  ,"auditor_notice" : '要確認'
  ,"auditor_toggle_display_of" : '表示を切り替える'
  ,"auditor_messages" : 'メッセージ'
  ,"auditor_unable_to_point" : 'この問題に関連する要素を指すことができません。'
  ,"auditor_unable_to_point_entire" : 'ドキュメント全体に関連するため、特定の箇所を指摘できません。'
  ,"auditor_unable_to_point_removed" : 'レポートが生成されてから文書から削除されたため、問題の箇所を指すことができません。'
  ,"auditor_unable_to_point_outside" : '要素がドキュメントのbody要素の外側にあるため、問題の箇所を指すことができません。'
  ,"auditor_unable_to_point_hidden" : '隠されているか視覚的に表示されていないため、問題の箇所を指すことができません。'
  ,"auditor_point_to_element" : '問題の要素'
  ,"auditor_unsupported_browser" : 'この機能は、このブラウザではサポートされていません。'
  ,"auditor_page" : 'ページ'
  ,"auditor_updated_to" : 'HTML_CodeSniffer はアップデートされています'
  ,"auditor_view_the_changelog" : '変更履歴を見る'
  ,"auditor_success_criterion" : "達成基準"
  ,"auditor_suggested_techniques" : "推奨される実装方法"
  ,"auditor_applies_entire_document" : "これは文書全体に適用されます"

  //1_1_1.js
  ,"1_1_1_H30.2" : 'リンクの内容が img要素のみですが、alt属性が見つかりません。alt属性値に入れた代替テキストによってリンクの目的を適切に説明する必要があります。'
  ,"1_1_1_H67.1" : 'alt属性値が空の img要素は title属性を持たないか、title属性値が空である必要があります。'
  ,"1_1_1_H67.2" : 'この img要素は支援技術から無視されるようにマークアップされています。装飾画像などで alt属性が空の場合が考えられます。空の alt属性が意図したものか確認してください。'
  ,"1_1_1_H37" : 'img要素に alt属性がありません。alt属性を使用して適切な代替テキストを提供てください。'
  ,"1_1_1_G94.Image" : '画像の代替テキストが画像の内容を正しく示しているか確認してください。'
  ,"1_1_1_H36" : '送信・実行ボタンとして使用されている画像に alt属性が見当たりません。alt属性によって代替テキストを提供し、ボタンの機能を適切に説明してください。'
  ,"1_1_1_G94.Button" : '画像による送信・実行ボタンに付与された alt属性値によってボタンの目的が適切に説明されているか確認してください。'
  ,"1_1_1_H24" : 'イメージマップ内の area要素に alt属性が見当たりません。各 area要素には alt属性によって代替テキストを提供し、その領域の機能や目的を適切に説明してください。'
  ,"1_1_1_H24.2" : 'area要素の代替テキストがイメージマップ内の該当する選択可能領域の内容を正しく示しているか確認してください。'
  ,"1_1_1_G73,G74" : '画像の内容を代替テキストのみで説明できない場合は、前後の文脈や別途用意した説明文（またはページ）によって正しく内容が理解できるようになっているか確認してください。'
  ,"1_1_1_H2.EG5" : 'リンク内にある img要素の代替テキストとリンクテキストが重複しています。'
  ,"1_1_1_H2.EG4" : '代替テキストを持たない img要素を含むリンクとリンクテキストを含むリンクが隣接しています。2つのリンクの統合を検討してください。'
  ,"1_1_1_H2.EG3" : 'リンク内にある img要素の代替テキストと隣接するリンクテキストが重複しています。'
  ,"1_1_1_H53,ARIA6" : 'object要素の内容として、代替テキストを記述する必要があります。object要素に未対応の環境で利用されます。'
  ,"1_1_1_G94,G92.Object,ARIA6" : '非テキストコンテンツに対してそれと同じ目的を果たし同じ情報を提供する簡潔な（または適切であれば長い）代替テキストが提供されていることを確認してください。'
  ,"1_1_1_H35.3" : 'applet要素の内容として、代替テキストを記述する必要があります。applet要素に未対応の環境で利用されます。'
  ,"1_1_1_H35.2" : 'applet要素には alt属性によって代替テキストを提供する必要があります。applet要素に未対応の環境で利用されます。'
  ,"1_1_1_G94,G92.Applet" : '非テキストコンテンツに対してそれと同じ目的を果たし同じ情報を提供する簡潔な（または適切であれば長い）代替テキストが提供されていることを確認してください。'


  //1_2_1.js
  ,"1_2_1_G158" : 'この埋め込みオブジェクトが収録済の音声しか含まず、かつそれがテキストの代替メディアでない場合、代替コンテンツが提供され、ユーザーが利用可能か確認してください。'
  ,"1_2_1_G159,G166" : 'この埋め込みオブジェクトが収録済の映像しか含まず、かつそれがテキストの代替メディアでない場合、代替コンテンツ、または映像と同期した音声解説が提供され、ユーザーが利用可能か確認してください。'


  //1_2_2.js
  ,"1_2_2_G87,G93" : 'この埋め込みオブジェクトが収録済の同期したメディア、かつテキストの代替メディアでない場合、すべての収録済の音声コンテンツに対してキャプションが提供され、ユーザーが利用可能か確認してください。'


  //1_2_3.js
  ,"1_2_3_G69,G78,G173,G8" : 'もし収録済の同期したメディア、かつテキストの代替メディアでない埋め込みオブジェクトが存在する場合、代替コンテンツ、または映像と同期した音声解説が提供され、ユーザーが利用可能か確認してください。'


  //1_2_4.js
  ,"1_2_4_G9,G87,G93" : 'この埋め込みオブジェクトが収録済の同期したメディアの場合、すべての収録済の音声コンテンツに対してキャプションが提供され、ユーザーが利用可能か確認してください。'


  //1_2_5.js
  ,"1_2_5_G78,G173,G8" : 'この埋め込みオブジェクトが収録済の同期したメディアの場合、映像と同期した音声解説が提供され、ユーザーが利用可能か確認してください。'


  //1_2_6.js
  ,"1_2_6_G54,G81" : 'この埋め込みオブジェクトが収録済の同期したメディアの場合、すべての収録済の音声コンテンツに対して手話通訳が提供され、ユーザーが利用可能か確認してください。'


  //1_2_7.js
  ,"1_2_7_G8" : 'この埋め込みオブジェクトが収録済の同期したメディアの場合で、前景音が映像と同等の意味を伝達する音声ガイドを挿入するための十分な長さの合間を含まない場合、同期したメディアに含まれているすべての収録済の映像コンテンツに対して、拡張した音声ガイドが提供され、ユーザーが利用可能か確認してください。'


  //1_2_8.js
  ,"1_2_8_G69,G159" : 'この埋め込みオブジェクトが収録済の同期したメディア、及び収録済の映像しか含まないメディアの場合、代替コンテンツが提供され、ユーザーが利用可能か確認してください。'


  //1_2_9.js
  ,"1_2_9_G150,G151,G157" : 'この埋め込みオブジェクトがライブの音声しか含まない場合、代替コンテンツが提供され、ユーザーが利用可能か確認してください。'


  //1_3_1.js
  ,"1_3_1_F92,ARIA4" : 'この要素の役割(role)はプレゼンテーション(presentation)ですが、セマンティックな意味を持つ子要素が含まれています。'
  ,"1_3_1_H44.NonExistent" : 'この label要素の for属性値には、文書内に存在しない id属性値が指定されています。'
  ,"1_3_1_H44.NonExistentFragment" : 'この label要素の for属性値には、文書内に存在しない id属性値が指定されています。 '
  ,"1_3_1_H44.NotFormControl" : 'この label要素の for属性値には、フォームコントロールでない要素に指定された id属性値が指定されています。意図した指定か確認してください。'
  ,"1_3_1_H65" : 'このフォームコントロールは、空、もしくは空白文字のみの属性値が指定された title属性を持っています。この title属性はユーザーエージェントや支援技術から無視されます。'
  ,"1_3_1_ARIA6" : 'このフォームコントロールは、空、もしくは空白文字のみの属性値が指定された aria-label属性を持っています。この aria-label属性はユーザーエージェントや支援技術から無視されます。'
  //{{id}} will be replace with element ID:
  ,"1_3_1_ARIA16,ARIA9" : 'このフォームコントロールにはaria-labelledby属性が含まれていますが、要素には存在しないID"{{id}}"が含まれています。 aria-labelledby属性は、テスト目的のラベル付けのために無視されます。'

  ,"1_3_1_F68.Hidden" : 'この隠し(hidden)フォームコントロールは、何らかの方法によってラベルが提示されています。隠し入力コントロールにはラベルを提示しないでください。'
  ,"1_3_1_F68.HiddenAttr" : 'このフォームコントロールは、hidden属性によって非表示にすることが意図されていますが、何らかの方法によってラベルが提示されています。非表示の入力コントロールにはラベルを提示しないでください。'
  ,"1_3_1_F68" : 'このフォームフィールドには何らかの方法でラベルを付ける必要があります。label要素（for属性またはフォームフィールドを囲む）、または title、aria-labelまたは aria-labelledby属性を適切に使用してください。'

  ,"1_3_1_H49." : 'HTML5では廃止されたプレゼンテーションマークアップが使用されました。'
  ,"1_3_1_H49.AlignAttr" : 'align属性'
  ,"1_3_1_H49.Semantic" : 'セマンティックなマークアップは、強調されたテキストまたは特殊なテキストをプログラムで決定できるようにマークするために使用してください。'
  ,"1_3_1_H49.AlignAttr.Semantic" : 'セマンティックなマークアップは、強調されたテキストまたは特殊なテキストをプログラムで決定できるようにマークするために使用してください。'

  ,"1_3_1_H42" : 'このコンテンツに見出しとしての意味がある場合、適切な見出し要素でマークアップされる必要があります。'

  ,"1_3_1_H63.3" : 'セルが不正な scope属性値を持っています。正しい値は、row、col、rowgroup、colgroup のいずれかです。'
  ,"1_3_1_H63.2" : 'HTML5 では、scope属性を td要素に使用することはできません。th要素に使用してください。'
  ,"1_3_1_H43.ScopeAmbiguous" : '行見出しが複数あるテーブルで、th要素に指定された scope属性では関連付けが曖昧な場合、td要素に headers属性を使用します。'
  ,"1_3_1_H43.IncorrectAttr" : '間違った headers属性値がこの td要素に付与されています。 正しいのはおそらく "{{expected}}" ですが、見つかった値は "{{actual}}"です。'
  ,"1_3_1_H43.HeadersRequired" : '見出しセル（th要素）とデータセル（td要素）の関係性が定義されていません。このテーブルには行見出しが複数あるため、td要素に headers属性を使用する必要があります。'
  ,"1_3_1_H43.MissingHeaderIds" : 'このテーブル内のすべての th要素には id属性が付与されていません。td要素に headers属性を用いて参照するためには、id属性を持っている必要があります。'
  ,"1_3_1_H43.MissingHeadersAttrs" : 'このテーブル内のすべての td要素には headers属性が付与されていません。headers属性には関連付ける th要素が持つ id属性値をすべて指定する必要があります。'
  ,"1_3_1_H43,H63" : '見出しセル（th要素）とデータセル（td要素）の関係性が定義されていません。scope属性や headers属性を用いて関係性を示す必要があります。'
  ,"1_3_1_H63.1" : 'このテーブル内のすべての th要素には scope属性が付与されていません。データセルと関連付けるため、scope属性を付与する必要があります。'

  ,"1_3_1_H73.3.LayoutTable" : 'このテーブルはレイアウトのために使用されていると思われますが、summary属性が付与されています。レイアウトテーブルは summary属性を持たないか、属性値が空の必要があります。'
  ,"1_3_1_H39,H73.4" : 'このテーブルがデータテーブルで summary属性と caption要素が同時に存在する場合、summary属性には caption要素と同じ内容を入れることはできません。'
  ,"1_3_1_H73.3.Check" : 'このテーブルがデータテーブルの場合、summary属性がテーブルの内容について適切に説明しているか確認してください。'
  ,"1_3_1_H73.3.NoSummary" : 'このテーブルがデータテーブルの場合、summary属性を用いてこのテーブルの概要を提供することを検討してください。'
  ,"1_3_1_H39.3.LayoutTable" : 'このテーブルはレイアウトのために使用されていると思われますが、caption要素が含まれています。レイアウトテーブルは caption要素を持つべきではありません。'
  ,"1_3_1_H39.3.Check" : 'このテーブルがデータテーブルの場合、caption要素がテーブルの表題について適切に示しているか確認してください。'
  ,"1_3_1_H39.3.NoCaption" : 'このテーブルがデータテーブルの場合、このテーブルを識別できるように caption要素を使用して表題を提供することを検討してください。'

  ,"1_3_1_H71.NoLegend" : 'fieldset要素に legend要素が含まれていません。すべての fieldset要素には legend要素によって説明文を記述する必要があります。'
  ,"1_3_1_H85.2" : 'このセレクトメニューの選択肢の中に関連する選択肢のグループが含まれる場合、optgroup要素によってグループ化する必要があります。'

  ,"1_3_1_H71.SameName" : 'これらのラジオボタン、チェックボックスをグループ化したい場合、それらは fieldset要素内に含まれるべきです。'

  ,"1_3_1_H48.1" : 'このコンテンツはプレーンテキストを使用して箇条書きを再現しているように見えます。その場合、ul要素によってマークアップすることで、適切な文書構造を持つことができます。'
  ,"1_3_1_H48.2" : 'このコンテンツはプレーンテキストを使用して順序付きリストを再現しているように見えます。その場合、ol要素によってマークアップすることで、適切な文書構造を持つことができます。'

  ,"1_3_1_G141_a" : 'この見出し構造は適切にネストされていません。この h{{headingNum}}要素が主な文書見出しのように見えるので、h1要素にする必要があります。'
  ,"1_3_1_G141_b" : 'この見出し構造は適切にネストされていません。この h{{headingNum}}要素は h{{properHeadingNum}}要素にすべきです。'

  ,"1_3_1_H42.2" : '見出し要素が空です。見出しとして意図されていないテキストに見出しタグを付けるべきではありません。'
  ,"1_3_1_H48" : 'この要素がナビゲーションセクションを含む場合、リスト要素でマークアップすることを推奨します。'

  ,"1_3_1_LayoutTable" : 'このテーブルはレイアウトテーブルと思われます。もしデータテーブルを意図している場合は、th要素を使用して見出しセルが認識できることを確認してください。'
  ,"1_3_1_DataTable" : 'このテーブルはデータテーブルと思われます。もしレイアウトテーブルを意図している場合は、th要素や caption要素が含まれていたり、summary属性が指定されていないことを確認してください。'


  //1_3_2.js
  ,"1_3_2_G57" : 'スタイルシートが無効な場合でも、コンテンツが意味のある順序で並べられていることを確認してください。'


  //1_3_3.js
  ,"1_3_3_G96" : 'コンテンツを理解し操作するための説明は、感覚的な特徴（形、大きさ、視覚的な位置など）だけに依存してはいけません。'


  //1_4_1.js
  ,"1_4_1_G14,G18" : '色の違いで伝えている情報は、テキスト、または他の視覚的な方法によってもユーザーが理解できる手段が提供されていることを確認してください。'


  //1_4_2.js
  ,"1_4_2_F23" : 'もし Webページ上にある音声が自動的に、3秒以上再生される場合、その音声を一時停止、または停止、あるいは音量を調整可能な仕組みが提供されているか確認してください。'


  //1_4_3_F24.js
  ,"1_4_3_F24.BGColour" : 'この要素にはインラインで背景色、あるいは背景画像が指定されていますが前景色が指定されていません。適切なコントラストが確保されているか確認してください。'
  ,"1_4_3_F24.FGColour" : 'この要素にはインラインで前景色が指定されていますが背景色、あるいは背景画像が指定されていません。適切なコントラストが確保されているか確認してください。'


  //1_4_3.js
  ,"1_4_3_G18_or_G145.Abs" : 'この要素は絶対位置で配置され背景色が特定できません。文字色と背景色との間に少なくとも {{required}}:1 のコントラスト比が確保されているか確認してください。'
  ,"1_4_3_G18_or_G145.BgImage" : 'このテキストは背景画像の上に置かれています。背景とテキストのコントラスト比が少なくとも {{required}}:1 以上あることを確認してください。'
  ,"1_4_3_G18_or_G145.Alpha" : 'この要素のテキストまたは背景は透過指定されています。テキストと背景のコントラスト比が少なくとも {{required}}:1 以上あることを確認してください。'
  ,"1_4_3_G18_or_G145.Fail" : 'この要素はこの適合レベルに必要なコントラスト比が確保されていません。少なくとも {{required}}:1 のコントラスト比が必要ですが、この要素のテキストのコントラスト比は {{value}}:1 です。'
  ,"1_4_3_G18_or_G145.Fail.Recomendation" : '推薦: 変更'
  ,"1_4_3_G18_or_G145.Fail.Recomendation.Text" : 'テキストの色を'
  ,"1_4_3_G18_or_G145.Fail.Recomendation.Background" : '背景の色を'


  //1_4_4.js
  ,"1_4_4_G142" : 'テキストはコンテンツ、または機能を損なうことなく、支援技術なしで 200% までサイズを変更できることを確認してください。'


  //1_4_5.js
  ,"1_4_5_G140,C22,C30.AALevel" : '画像化された文字がユーザーの要求に応じて視覚的にカスタマイズできる場合、または純粋な装飾目的、もしくはその情報を伝える上でテキストを特定の形で表現することが必要不可欠である場合に限って、文字画像が使用されていることを確認してください。'


  //1_4_6.js
  ,"1_4_6_G18_or_G17.Abs" : 'この要素は絶対位置で配置され背景色が特定できません。文字色と背景色との間に少なくとも {{required}}:1 のコントラスト比が確保されているか確認してください。'
  ,"1_4_6_G18_or_G17.BgImage" : 'この要素のテキストは背景画像の上に置かれています。文字色と背景色との間に少なくとも {{required}}:1 のコントラスト比が確保されているか確認してください。'
  ,"1_4_6_G18_or_G17.Fail" : 'この要素はこの適合レベルに必要なコントラスト比を確保していません。少なくとも {{required}}:1 コントラスト比が必要ですが、要素内のテキストのコントラスト比は {{value}}:1 しかありません。'
  ,"1_4_6_G18_or_G17.Fail.Recomendation" : '推薦: 変更'
  ,"1_4_6_G18_or_G17.Fail.Recomendation.Text" : 'テキストの色を'
  ,"1_4_6_G18_or_G17.Fail.Recomendation.Background" : '背景の色を'



  //1_4_7.js
  ,"1_4_7_G56" : '主音声（ナレーションや発言など）を背景音より少なくとも 20 デジベル大きく、または主音声は背景音よりも 4 倍大きくなるように音声コンテンツが用意されている、あるいは背景音を消すことができる必要があります。'


  //1_4_8.js
  ,"1_4_8_G148,G156,G175" : '一般に入手可能なユーザーエージェント（ブラウザなど）で、ユーザーがテキストブロックの前景色、及び背景色を選択できるか確認してください。'
  ,"1_4_8_H87,C20" : '1行の長さを平均 80字を越えない（日本語など全角文字の場合は 40字）サイズに収めることができるか確認してください。'
  ,"1_4_8_C19,G172,G169" : 'テキストが均等割り付けされていない（両端揃えではない）ことを確認してください。'
  ,"1_4_8_G188,C21" : '段落中の行送りが少なくとも 1.5 文字分あり、また段落の間隔は、その行送りの少なくとも 1.5 倍以上あることを確認してください。'
  ,"1_4_8_H87,G146,C26" : '支援技術を用いなくても、テキストのサイズを 200% まで変更できること、またユーザーが全画面表示にしたウィンドウで、1 行のテキストを読むときに横スクロールする必要がないことを確認してください。'


  //1_4_9.js
  ,"1_4_9_G140,C22,C30.NoException" : '純粋な装飾目的、もしくはその情報を伝える上でテキストを特定の形で表現することが必要不可欠である場合に限って、文字画像が使用されていることを確認してください。'


  //2_1_1.js
  ,"2_1_1_G90" : 'この要素のイベントハンドラによって提供される機能が、キーボード操作でも利用可能なことを確認してください。'
  ,"2_1_1_SCR20.DblClick" : 'この要素をダブルクリックした際に提供される機能が、キーボード操作でも利用可能なことを確認してください。'
  ,"2_1_1_SCR20.MouseOver" : 'この要素にマウスカーソルを重ねた際に提供される機能が、キーボード操作でも利用可能なことを確認してください（例えば focus イベントを使用）。'
  ,"2_1_1_SCR20.MouseOut" : 'この要素の外にマウスカーソルを移動した際に提供される機能が、キーボード操作でも利用可能なことを確認してください（例えば blur イベントを使用）。'
  ,"2_1_1_SCR20.MouseMove" : 'この要素の上でマウスカーソルを動かした際に提供される機能が、キーボード操作でも利用可能なことを確認してください。'
  ,"2_1_1_SCR20.MouseDown" : 'この要素の上でマウスボタンを押下した際に提供される機能が、キーボード操作でも利用可能なことを確認してください（例えば KeyDown イベントを使用）。'
  ,"2_1_1_SCR20.MouseUp" : 'この要素の上でマウスボタンを放した際に提供される機能が、キーボード操作でも利用可能なことを確認してください（例えば KeyUp イベントを使用）。'


  //2_1_2.js
  ,"2_1_2_F10" : 'キーボード操作によってプラグイン、または埋め込みアプリケーションによって描写されるコンポーネントにフォーカスが移動できる場合、キーボード操作だけを用いてそのコンポーネントからフォーカスを外すことが可能であることを確認してください。'


  //2_2_1.js
  ,"2_2_1_F40.2" : 'meta要素によるリダイレクトが 0秒以外で指定されています。ユーザーはこの制限時間を変更、または解除することができません。'
  ,"2_2_1_F41.2" : 'meta要素による Webページの再読込が行われています。ユーザーはこの制限時間を変更、または解除することができません。'


  //2_2_2.js
  ,"2_2_2_SCR33,SCR22,G187,G152,G186,G191" : '自動的に開始し、かつ 5 秒以上継続して動きのある、点滅している、スクロールする情報、または自動更新する情報について、それらを一時停止、停止、または非表示にする仕組みが利用可能なことを確認してください。'
  ,"2_2_2_F4" : 'ユーザーが点滅するコンテンツを 5秒未満で停止可能な仕組みが提供されているか確認してください。'
  ,"2_2_2_F47" : 'ユーザーが点滅するコンテンツを 5秒未満で停止可能な仕組みが提供されていません。'


  //2_2_3.js
  ,"2_2_3_G5" : 'インタラクティブではない同期したメディア、及びリアルタイムのイベントを除き、制限時間がコンテンツが提示するイベント、または動作の必要不可欠な部分ではないことを確認してください。'


  //2_2_4.js
  ,"2_2_4_SCR14" : '緊急を要する中断を除き、ユーザーが中断を延期、または抑制することができることを確認してください。'


  //2_2_5.js
  ,"2_2_5_G105,G181" : '認証済のセッションが切れた場合、再認証後でもデータを失うことなくユーザーが操作を継続できることを確認してください。'


  //2_3_1.js
  ,"2_3_1_G19,G176" : '任意のどの 1秒間においても、3回よりも多く閃光を放つ部分がないこと、あるいはその部分のサイズが十分に小さいことを確認してください。'


  //2_3_2.js
  ,"2_3_2_G19" : '任意のどの 1秒間においても、3回よりも多く閃光を放つ部分がないことを確認してください。'


  //2_4_1.js
  ,"2_4_1_H64.1" : 'iframe要素にはその内容を説明するための title属性が必要です。'
  ,"2_4_1_H64.2" : 'iframe要素に付与された title属性の値がそのフレームの内容を適切に示しているか確認してください。'
  ,"2_4_1_G1,G123,G124,H69" : '複数の Webページ上で繰り返されているナビゲーションなどの要素をスキップできる機能が提供されているか確認してください。'
  ,"2_4_1_G1,G123,G124.NoSuchID" : 'このリンクは "{{id}}" という名前のアンカーにリンクされていますが、この文書内で該当する名前が見つかりません。'
  ,"2_4_1_G1,G123,G124.NoSuchIDFragment" : 'このリンクは "{{id}}" という名前のアンカーにリンクされていますが、この文書内で該当する名前が見つかりません。'


  //2_4_2.js
  ,"2_4_2_H25.1.NoHeadEl" : 'title要素を配置する head要素が見つかりません。Webページには適切なタイトルを付ける必要があります。'
  ,"2_4_2_H25.1.NoTitleEl" : 'Webページには適切なタイトルを付ける必要があります。'
  ,"2_4_2_H25.1.EmptyTitle" : 'title要素は空であるべきではありません。'
  ,"2_4_2_H25.2" : 'title要素が文書の内容を適切に示しているか確認してください。'


  //2_4_3.js
  ,"2_4_3_H4.2" : 'tabindex属性を使用する場合はタブ移動順序とコンテンツ順序の関係を確認してください。'


  //2_4_4.js
  ,"2_4_4_H77,H78,H79,H80,H81,H33" : 'リンクテキスト自体、及び前後の文脈や title属性の値からリンクの目的が正しく理解できるか確認してください。'
  ,"2_4_4_H77,H78,H79,H80,H81" : 'リンクテキスト自体、及び前後の文脈からリンクの目的が正しく理解できるか確認してください。'


  //2_4_5.js
  ,"2_4_5_G125,G64,G63,G161,G126,G185" : 'Webページ一式の中で、ある Webページを見つける複数の手段が利用できることを確認してください。ただし、この Webページが一連のプロセスの中の 1ステップ、あるいは結果である場合は除きます。'


  //2_4_6.js
  ,"2_4_6_G130,G131" : 'この見出し、及びラベルが主題、または目的を適切に説明しているか確認してください。'


  //2_4_7.js
  ,"2_4_7_G149,G165,G195,C15,SCR31" : 'フォーカスを受け取った際に、フォーカスインジケータによってそれが認識できることを確認してください。'


  //2_4_8.js
  ,"2_4_8_H59.1" : 'link要素は head要素内のみに配置することができます。'
  ,"2_4_8_H59.2a" : 'link要素には rel属性が必要です。'
  ,"2_4_8_H59.2b" : 'link要素に href要素が指定されていない、あるいは href属性値が空です。'


  //2_4_9.js
  ,"2_4_9_H30" : 'リンクの目的を説明するリンクテキストが提供されているか確認してください。'



  //3_1_1.js
  ,"3_1_1_H57.2" : 'html要素は文書の言語を示す lang属性、または xml:lang属性を持っている必要があります。'
  ,"3_1_1_H57.3.Lang" : 'この文書に指定された lang属性の値は不正です。'
  ,"3_1_1_H57.3.XmlLang" : 'この文書に指定された xml:lang属性の値は不正です。'


  //3_1_2.js
  ,"3_1_2_H58" : '言語の変更は lang属性、または xml:lang属性のいずれか、もしくは両方の指定によって行われているか確認してください。'
  ,"3_1_2_H58.1.Lang" : 'この要素に指定された lang属性の値は不正です。'
  ,"3_1_2_H58.1.XmlLang" : 'この要素に指定された xml:lang属性の値は不正です。'


  //3_1_3.js
  ,"3_1_3_H40,H54,H60,G62,G70" : '慣用句や専門用語など一般的ではない、または限定された用法で使われている単語、語句の明確な定義を特定する仕組みが利用できることを確認してください。'


  //3_1_4.js
  ,"3_1_4_G102,G55,G62,H28,G97" : '略語の元の語や意味を特定する仕組みが利用できることを確認してください。'


  //3_1_5.js
  ,"3_1_5_G86,G103,G79,G153,G160" : '文章が前期中等教育(中学生)レベルを超えた読解力を必要とする場合、補足コンテンツ、または前期中等教育レベルを超えた読解力を必要としない代替バージョンが利用できることを確認してください。'


  //3_1_6.js
  ,"3_1_6_H62.1.HTML5" : 'ruby要素に読み方を示す rt要素が含まれていません。'
  ,"3_1_6_H62.1.XHTML11" : 'ruby要素に rb要素でマークアップしたテキストの読み方を示す rt要素が含まれていません。'
  ,"3_1_6_H62.2" : 'ruby要素に、ルビに対応していない環境でもテキストとルビテキストの区切りがわかるようにするために用いられる rp要素が含まれていません。'


  //3_2_1.js
  ,"3_2_1_G107" : 'この入力コントロールがフォーカスを受け取ったときに状況の変化が発生しないことを確認してください。例えばフォーカスすることで勝手にフォームが送信されたりといった予期せぬイベントが発生することは避けてください。'


  //3_2_2.js
  ,"3_2_2_H32.2" : 'フォーム内に送信・実行ボタンが含まれていないため、キーボード操作でフォームを送信 / 実行することができません。送信 / 実行ボタンは、input 要素に type="submit"、input type="image" を指定するか、button 要素に type="submit" を指定することで作成することができます。'


  //3_2_3.js
  ,"3_2_3_G61" : '複数の Webページ上で繰り返されているナビゲーションは、一貫して相対的に同じ順序で出現しているか確認してください。ただし、ユーザーが変更した場合は除きます。'


  //3_2_4.js
  ,"3_2_4_G197" : 'Webページ一式の中で同じ機能を有するコンテンツに対して一貫したラベル、識別名、及び代替テキストが用いられ、ユーザーが一貫して識別できるか確認してください。'


  //3_2_5.js
  ,"3_2_5_H83.3" : 'このリンクは新しいウィンドウ（またはタブ）が開くようになっていますが、そのことがユーザーに伝わる情報が提供されているか確認してください。'


  //3_3_1.js
  ,"3_3_1_G83,G84,G85" : 'もし入力エラーが自動的に検出された場合は、エラーとなっている箇所が特定され、そのエラーがユーザーにテキストで説明されているか確認してください。'


  //3_3_2.js
  ,"3_3_2_G131,G89,G184,H90" : '入力コントロールの目的や内容がわかるラベルや説明（必須入力の項目であることがわかるようにするなど）が提供されているか確認してください。'


  //3_3_3.js
  ,"3_3_3_G177" : '入力エラーが自動的に検出され、修正方法を提案できる場合、その提案がユーザーに提示されているか確認してください。ただし、セキュリティ、あるいはコンテンツの目的を損なう場合は除きます。'


  //3_3_4.js
  ,"3_3_4_G98,G99,G155,G164,G168.LegalForms" : 'このフォームからの送信がユーザーにとって法律行為、もしくはお金のやり取りが生じる場合、またはユーザーが制御可能なデータを変更もしくは削除する、ユーザーが試験の解答を送信する場合は「送信の取消ができる」「ユーザーが入力したデータの入力エラーがチェックされ、ユーザーが修正する機会が提供される」「送信を完了する前にユーザーが情報の見直し、確認、及び修正をする機能が利用できる」の内、少なくとも 1つを満たしているか確認してください。'


  //3_3_5.js
  ,"3_3_5_G71,G184,G193" : 'Webページやコントロールに対するコンテキストに依存したヘルプが利用できるか確認してください。'


  //3_3_6.js
  ,"3_3_6_G98,G99,G155,G164,G168.AllForms" : 'このフォームへの投稿が完了する前に、ユーザーが入力内容の確認やエラーの修正を行う手段が提供されているか確認してください。'



  //4_1_1.js
  ,"4_1_1_F77" : 'ページの中に重複しているid属性"{{id}}"が見つかりました。'


  //4_1_2.js
  ,"4_1_2_H91.A.Empty" : 'リンクテキスト、もしくは href属性がなく、id属性が指定された a要素が見つかりました。親要素や付近の要素にその id属性を移動することを検討してください。'
  ,"4_1_2_H91.A.EmptyWithName" : 'リンクテキスト、もしくは href属性がなく、name属性が指定された a要素が見つかりました。id 属性に変更した上で、親要素や付近の要素に移動することを検討してください。'
  ,"4_1_2_H91.A.EmptyNoId" : 'リンクテキストが空で、name属性、または id属性のいずれか、あるいはその両方がない a要素が見つかりました。'
  ,"4_1_2_H91.A.NoHref" : 'ページ内リンクのターゲットを定義するために a要素を使用すべきではありません。他の目的（例えばスタイルシートやスクリプトからの参照）で id属性を使用していない場合は、親要素に移動することを検討してください。'
  ,"4_1_2_H91.A.Placeholder" : 'リンクテキストを含む a要素が見つかりましたが、href 属性を持たず、name属性、id属性のいずれかも指定されていません。'
  ,"4_1_2_H91.A.NoContent" : 'href属性を持つ a要素が見つかりましたが、リンクテキストが空です。'


  ,"4_1_2_input_element" : 'input要素'
  ,"4_1_2_role_of_button" : '要素に role "button"が指定されていますが、'
  ,"4_1_2_element_content" : '要素内容'
  ,"4_1_2_element" : '要素'
  ,"4_1_2_msg_pattern" : 'この {{msgNodeType}} にはアクセシビリティ API で利用可能な識別名がありません。妥当な識別名は {{builtAttrs}}です。'
  ,"4_1_2_msg_pattern2" : 'この {{msgNodeType}} にはアクセシビリティ API で利用可能な値がありません。'
  ,"4_1_2_msg_add_one" : '要素にコンテンツを追加します。'
  ,"4_1_2_msg_pattern3" : 'この {{msgNodeType}} には初期値が指定されていません。使用されている HTMLのバージョンによって、アクセシビリティ APIに提供される値は未定義の場合があります。'
  ,"4_1_2_value_exposed_using_attribute" : '値は {{requiredValue}}属性を用いて提供されます。'
  ,"4_1_2_value_exposed_using_element" : '値は {{requiredValue}}要素を用いて提供されます。'

};
